; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v11 ?v13)
             (pred_2 ?v6 ?v5)
             (pred_11 ?v11 ?v5)
             (pred_5 ?v7 ?v11 )
	     (pred_9 ?v11)
             (pred_1 ?v10)
             (pred_12 ?v6)
             (pred_10 ?v5)
             (pred_7 ?v11)
             (pred_6 ?v6)
             (pred_3 ?v11)
             (pred_8 ))



(:action op_2
:parameters (?v4 ?v9 ?v3 ?v8)
:precondition (and (pred_1 ?v4) (pred_1 ?v9) (pred_12 ?v3) (pred_10 ?v8)
          (pred_4 ?v4 ?v9) (pred_2 ?v3 ?v8)
                   (pred_11 ?v9 ?v8) (pred_9 ?v4) 
                   (pred_7 ?v9) (pred_6 ?v3))
:effect (and  (pred_3 ?v9) (not (pred_7 ?v9))))


(:action op_1
:parameters (?v4 ?v2)
:precondition (and (pred_1 ?v4) (pred_1 ?v2)
               (pred_9 ?v4) (pred_4 ?v4 ?v2) (pred_3 ?v2))
:effect (and (pred_9 ?v2) (not (pred_9 ?v4))))

(:action op_5
:parameters (?v4 ?v3)
:precondition (and (pred_1 ?v4) (pred_12 ?v3) 
                  (pred_9 ?v4) (pred_5 ?v3 ?v4) (pred_8 ))
:effect (and (pred_6 ?v3)
   (not (pred_5 ?v3 ?v4)) (not (pred_8 ))))


(:action op_3
:parameters (?v4 ?v12 ?v1)
:precondition (and (pred_1 ?v4) (pred_12 ?v12) (pred_12 ?v1)
                  (pred_9 ?v4) (pred_6 ?v1) (pred_5 ?v12 ?v4))
:effect (and (pred_6 ?v12) (pred_5 ?v1 ?v4)
        (not (pred_6 ?v1)) (not (pred_5 ?v12 ?v4))))

(:action op_4
:parameters (?v4 ?v3)
:precondition (and (pred_1 ?v4) (pred_12 ?v3) 
                  (pred_9 ?v4) (pred_6 ?v3))
:effect (and (pred_8 ) (pred_5 ?v3 ?v4) (not (pred_6 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_22 obj_29 obj_09 obj_16 obj_23 obj_01 obj_27 obj_14 obj_08 obj_13 obj_24 obj_12 obj_02 obj_31 obj_07 obj_04 obj_28 obj_25 obj_30 obj_11 obj_15 obj_10 obj_26 obj_03 obj_05
    obj_06 obj_17 obj_18
    obj_21 obj_19 obj_20
    )

    (:init
       (pred_8)

       (pred_1 obj_22)
       (pred_1 obj_29)
       (pred_1 obj_09)
       (pred_1 obj_16)
       (pred_1 obj_23)
       (pred_1 obj_01)
       (pred_1 obj_27)
       (pred_1 obj_14)
       (pred_1 obj_08)
       (pred_1 obj_13)
       (pred_1 obj_24)
       (pred_1 obj_12)
       (pred_1 obj_02)
       (pred_1 obj_31)
       (pred_1 obj_07)
       (pred_1 obj_04)
       (pred_1 obj_28)
       (pred_1 obj_25)
       (pred_1 obj_30)
       (pred_1 obj_11)
       (pred_1 obj_15)
       (pred_1 obj_10)
       (pred_1 obj_26)
       (pred_1 obj_03)
       (pred_1 obj_05)
       (pred_10 obj_06)
       (pred_10 obj_17)
       (pred_10 obj_18)
       (pred_12 obj_21)
       (pred_12 obj_19)
       (pred_12 obj_20)

       (pred_4 obj_22 obj_01)
       (pred_4 obj_22 obj_29)
       (pred_4 obj_29 obj_27)
       (pred_4 obj_29 obj_09)
       (pred_4 obj_29 obj_22)
       (pred_4 obj_09 obj_14)
       (pred_4 obj_09 obj_16)
       (pred_4 obj_09 obj_29)
       (pred_4 obj_16 obj_08)
       (pred_4 obj_16 obj_23)
       (pred_4 obj_16 obj_09)
       (pred_4 obj_23 obj_13)
       (pred_4 obj_23 obj_16)
       (pred_4 obj_01 obj_24)
       (pred_4 obj_01 obj_27)
       (pred_4 obj_01 obj_22)
       (pred_4 obj_27 obj_12)
       (pred_4 obj_27 obj_14)
       (pred_4 obj_27 obj_29)
       (pred_4 obj_27 obj_01)
       (pred_4 obj_14 obj_02)
       (pred_4 obj_14 obj_08)
       (pred_4 obj_14 obj_09)
       (pred_4 obj_14 obj_27)
       (pred_4 obj_08 obj_31)
       (pred_4 obj_08 obj_13)
       (pred_4 obj_08 obj_16)
       (pred_4 obj_08 obj_14)
       (pred_4 obj_13 obj_07)
       (pred_4 obj_13 obj_23)
       (pred_4 obj_13 obj_08)
       (pred_4 obj_24 obj_04)
       (pred_4 obj_24 obj_12)
       (pred_4 obj_24 obj_01)
       (pred_4 obj_12 obj_28)
       (pred_4 obj_12 obj_02)
       (pred_4 obj_12 obj_27)
       (pred_4 obj_12 obj_24)
       (pred_4 obj_02 obj_25)
       (pred_4 obj_02 obj_31)
       (pred_4 obj_02 obj_14)
       (pred_4 obj_02 obj_12)
       (pred_4 obj_31 obj_30)
       (pred_4 obj_31 obj_07)
       (pred_4 obj_31 obj_08)
       (pred_4 obj_31 obj_02)
       (pred_4 obj_07 obj_11)
       (pred_4 obj_07 obj_13)
       (pred_4 obj_07 obj_31)
       (pred_4 obj_04 obj_15)
       (pred_4 obj_04 obj_28)
       (pred_4 obj_04 obj_24)
       (pred_4 obj_28 obj_10)
       (pred_4 obj_28 obj_25)
       (pred_4 obj_28 obj_12)
       (pred_4 obj_28 obj_04)
       (pred_4 obj_25 obj_26)
       (pred_4 obj_25 obj_30)
       (pred_4 obj_25 obj_02)
       (pred_4 obj_25 obj_28)
       (pred_4 obj_30 obj_03)
       (pred_4 obj_30 obj_11)
       (pred_4 obj_30 obj_31)
       (pred_4 obj_30 obj_25)
       (pred_4 obj_11 obj_05)
       (pred_4 obj_11 obj_07)
       (pred_4 obj_11 obj_30)
       (pred_4 obj_15 obj_10)
       (pred_4 obj_15 obj_04)
       (pred_4 obj_10 obj_26)
       (pred_4 obj_10 obj_28)
       (pred_4 obj_10 obj_15)
       (pred_4 obj_26 obj_03)
       (pred_4 obj_26 obj_25)
       (pred_4 obj_26 obj_10)
       (pred_4 obj_03 obj_05)
       (pred_4 obj_03 obj_30)
       (pred_4 obj_03 obj_26)
       (pred_4 obj_05 obj_11)
       (pred_4 obj_05 obj_03)
       (pred_7 obj_25)
       (pred_7 obj_29)
       (pred_7 obj_12)
       (pred_11  obj_25 obj_06)
       (pred_11  obj_29 obj_17)
       (pred_11  obj_12 obj_18)
       (pred_3 obj_22)
       (pred_3 obj_09)
       (pred_3 obj_16)
       (pred_3 obj_23)
       (pred_3 obj_01)
       (pred_3 obj_27)
       (pred_3 obj_14)
       (pred_3 obj_08)
       (pred_3 obj_13)
       (pred_3 obj_24)
       (pred_3 obj_02)
       (pred_3 obj_31)
       (pred_3 obj_07)
       (pred_3 obj_04)
       (pred_3 obj_28)
       (pred_3 obj_30)
       (pred_3 obj_11)
       (pred_3 obj_15)
       (pred_3 obj_10)
       (pred_3 obj_26)
       (pred_3 obj_03)
       (pred_3 obj_05)

       (pred_2  obj_21 obj_06)
       (pred_2  obj_19 obj_17)
       (pred_2  obj_20 obj_18)
       (pred_5 obj_21 obj_13)
       (pred_5 obj_19 obj_09)
       (pred_5 obj_20 obj_23)
       (pred_9 obj_22)
    )

    (:goal (and
       (pred_5 obj_21 obj_24)
       (pred_5 obj_19 obj_07)
    ))
(:constraints
  (always (not (pred_9 obj_08)))
)
)

; plan
1. (op_1 obj_22 obj_01)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_01)
   goals met: 0 of 2
2. (op_1 obj_01 obj_27)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_27)
   goals met: 0 of 2
3. (op_1 obj_27 obj_14)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_14)
   goals met: 0 of 2
4. (op_1 obj_14 obj_09)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_09)
   goals met: 0 of 2
5. (op_5 obj_09 obj_19)
   deleted: (pred_5 obj_19 obj_09) (pred_8)
   added: (pred_6 obj_19)
   goals met: 0 of 2
6. (op_1 obj_09 obj_16)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_16)
   goals met: 0 of 2
7. (op_1 obj_16 obj_23)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_23)
   goals met: 0 of 2
8. (op_1 obj_23 obj_13)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_13)
   goals met: 0 of 2
9. (op_1 obj_13 obj_07)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_07)
   goals met: 0 of 2
10. (op_4 obj_07 obj_19)
   deleted: (pred_6 obj_19)
   added: (pred_8) (pred_5 obj_19 obj_07)
   goals met: 1 of 2
11. (op_1 obj_07 obj_13)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_13)
   goals met: 1 of 2
12. (op_5 obj_13 obj_21)
   deleted: (pred_5 obj_21 obj_13) (pred_8)
   added: (pred_6 obj_21)
   goals met: 1 of 2
13. (op_1 obj_13 obj_23)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_23)
   goals met: 1 of 2
14. (op_1 obj_23 obj_16)
   deleted: (pred_9 obj_23)
   added: (pred_9 obj_16)
   goals met: 1 of 2
15. (op_1 obj_16 obj_09)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_09)
   goals met: 1 of 2
16. (op_1 obj_09 obj_14)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_14)
   goals met: 1 of 2
17. (op_1 obj_14 obj_27)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_27)
   goals met: 1 of 2
18. (op_1 obj_27 obj_01)
   deleted: (pred_9 obj_27)
   added: (pred_9 obj_01)
   goals met: 1 of 2
19. (op_1 obj_01 obj_24)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_24)
   goals met: 1 of 2
20. (op_4 obj_24 obj_21)
   deleted: (pred_6 obj_21)
   added: (pred_8) (pred_5 obj_21 obj_24)
   goals met: 2 of 2
